// Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом
// направлении и на одну клетку по горизонтали, или наоборот. Даны две
// различные клетки шахматной доски, определите, может ли конь попасть
// с первой клетки на вторую одним ходом.

#include <iostream>
using namespace std;

int main() {
  int x1, x2, y1, y2;
  cin >> x1 >> y1 >> x2 >> y2;
  if ((((x1 - x2 == 1) || (x1 - x2 == -1)) && ((y1 - y2 == 2) || (y1 - y2 == -2))) || (((y1 - y2 == 1) || (y1 - y2 == -1)) && ((x1 - x2 == 2) || (x1 - x2 == -2)))) {
      cout << "YES";
  }
  else {
      cout << "NO";
  }
  return 0;
}