// Дано натуральное число, выведите его последнюю цифру.

#include <iostream>
using namespace std;

int main() {
    int N;
    cin >> N;
    cout << N % 10;
    return 0;
}