// Дано двузначное число. Выведите его первую цифру (число десятков)

#include <iostream>
using namespace std;

int main() {
    int N;
    cin >> N;
    cout << N / 10;
    return 0;
}